backend/app/controllers/api/expenses_controller.rb

INSERT INTO "expenses" ("name") VALUES ($1) RETURNING "id"  [["name", "Chicago Trip"]]
---
    def create
        @expense = Expense.create(expense_params)

SELECT "expenses".* FROM "expenses" WHERE "expenses"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "expenses" SET "name" = $1 WHERE "expenses"."id" = $2  [["name", "\n                    Cabelas"], ["id", 7]]
---
    def update
        @expense = Expense.find_by(id: params[:id])
        @expense.update(expense_params)