backend/app/controllers/api/items_controller.rb

INSERT INTO "items" ("name", "price", "quantity", "category", "expense_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Nike hoody"], ["price", 69.99], ["quantity", 1], ["category", "Leisure"], ["expense_id", 1]]
---
    def create
        @item = Item.create(item_params)

SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "items" SET "name" = $1 WHERE "items"."id" = $2  [["name", "Chipotle avacodo chicken melt "], ["id", 2]]
---
    def update
        @item = Item.find_by(id: params[:id])
        @item.update(item_params)